{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-style list of concise summaries for all frontend source files.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color tokens, themes, and base styles.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "Minimal root React component rendering the HugDaySlideshowPage.",
  "frontend/src/components/effects/AmbientRomanceEffects.tsx": "Generates animated floating hearts and petals with randomized particle effects.",
  "frontend/src/components/music/MusicToggle.tsx": "Play/pause button controlling a looping romantic background audio track.",
  "frontend/src/components/slideshow/slides/HugDaySceneSlide.tsx": "Main Hug Day scene slide with background art, headline, and message text.",
  "frontend/src/components/slideshow/slides/IntroSlide.tsx": "Intro slide with gradient background and welcome text.",
  "frontend/src/components/slideshow/Slideshow.tsx": "Slideshow container handling transitions and rendering navigation controls.",
  "frontend/src/components/slideshow/SlideshowControls.tsx": "Previous/Next buttons with accessibility and disabled-state behavior.",
  "frontend/src/components/slideshow/SlideTextOverlay.tsx": "Reusable animated text overlay for slide headlines and subtexts.",
  "frontend/src/components/slideshow/useSlideshowNavigation.ts": "Hook providing next/previous slide logic and keyboard arrow support.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing a backend actor based on authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking. Wraps AuthClient configuration and exposes a useInternetIdentity hook.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module exporting nothing, used because the frontend has no backend queries.",
  "frontend/src/index.css": "Defines global Tailwind layers, custom pastel romantic theme colors, fonts, utilities, and animations for the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HugDaySlideshowPage.tsx": "Renders the Hug Day slideshow page with intro and main slides, ambient effects, music toggle, and footer branding.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, components, and plugins for the pastel romantic theme.",
  "project_state.json": "Holds project metadata, feature requirements, and image specifications for the Hug Day romantic slideshow app."
}